In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

import matplotlib
matplotlib.rcParams['font.family']='NanumGothic'
matplotlib.rcParams['axes.unicode_minus'] = False

In [2]:
employee = [{'empno':1, 'ename':'kim', 'dept':1},
            {'empno':2, 'ename':'lee', 'dept':2},
            {'empno':3, 'ename':'park', 'dept':1},
            {'empno':4, 'ename':'song', 'dept':3},
            {'empno':5, 'ename':'min', 'dept':2}
           ]
dept=[{'dept':1, 'deptname':'관리직'},
      {'dept':2, 'deptname':'영업직'},
      {'dept':3, 'deptname':'개발직'}
     ]
info =[{'empno':1, 'addr':'서울시','phone':'010-1111-1111'},
       {'empno':3, 'addr':'부산시','phone':'010-2222-2222'},
       {'empno':2, 'addr':'광주시','phone':'010-3333-3333'},
       {'empno':5, 'addr':'광주시','phone':'010-4444-4444'},
       {'empno':4, 'addr':'광주시','phone':'010-5555-5555'}
      ]

In [3]:
emp = pd.DataFrame(employee)
dept = pd.DataFrame(dept)
info = pd.DataFrame(info)

In [4]:
df_students = pd.DataFrame({
    'student_id': [1, 2, 3, 4],
    'name': ['Alice', 'Bob', 'Charlie', 'David']
})

df_scores = pd.DataFrame({
    'student_id': [1, 2, 4, 5],
    'score': [85, 92, 78, 88]
})

In [5]:
df_students

   student_id     name
0           1    Alice
1           2      Bob
2           3  Charlie
3           4    David

In [7]:
df_scores

   student_id  score
0           1     85
1           2     92
2           4     78
3           5     88

In [ ]:
# pd.merge(df_students, df_scores, on='student_id', how='inner') # 사용 多
pd.merge(df_students, df_scores, on='student_id')

   student_id   name  score
0           1  Alice     85
1           2    Bob     92
2           4  David     78

In [ ]:
pd.merge(df_students, df_scores, on='student_id', how='left') # 왼쪽 값 다 나오게

   student_id     name  score
0           1    Alice   85.0
1           2      Bob   92.0
2           3  Charlie    NaN
3           4    David   78.0

In [ ]:
pd.merge(df_students, df_scores, on='student_id', how='right') #오른쪽 값 다 나오게

   student_id   name  score
0           1  Alice     85
1           2    Bob     92
2           4  David     78
3           5    NaN     88

In [13]:
pd.merge(df_students, df_scores, on='student_id', how='outer') # 전체 값이 다 나오게 -> outer

   student_id     name  score
0           1    Alice   85.0
1           2      Bob   92.0
2           3  Charlie    NaN
3           4    David   78.0
4           5      NaN   88.0

In [14]:
emp

   empno ename  dept
0      1   kim     1
1      2   lee     2
2      3  park     1
3      4  song     3
4      5   min     2

In [15]:
dept

   dept deptname
0     1      관리직
1     2      영업직
2     3      개발직

In [20]:
mdf = pd.merge( emp, dept, on='dept') #merge가 곧 join
mdf

   empno ename  dept deptname
0      1   kim     1      관리직
1      2   lee     2      영업직
2      3  park     1      관리직
3      4  song     3      개발직
4      5   min     2      영업직

In [21]:
info

   empno addr          phone
0      1  서울시  010-1111-1111
1      3  부산시  010-2222-2222
2      2  광주시  010-3333-3333
3      5  광주시  010-4444-4444
4      4  광주시  010-5555-5555

In [ ]:
pd.merge( mdf, info , on='empno').drop(columns=['empno','dept'])

  ename deptname addr          phone
0   kim      관리직  서울시  010-1111-1111
1   lee      영업직  광주시  010-3333-3333
2  park      관리직  부산시  010-2222-2222
3  song      개발직  광주시  010-5555-5555
4   min      영업직  광주시  010-4444-4444

In [25]:
df_students1 = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['Alice', 'Bob', 'Charlie', 'David']
})

df_scores1 = pd.DataFrame({
    'student_id': [1, 2, 4, 5],
    'score': [85, 92, 78, 88]
})

In [26]:
df_students1

   id     name
0   1    Alice
1   2      Bob
2   3  Charlie
3   4    David

In [27]:
df_scores1

   student_id  score
0           1     85
1           2     92
2           4     78
3           5     88

In [29]:
pd.merge( df_students1, df_scores1, 
        left_on='id', right_on='student_id', how='inner') # 공통 컬럼이 일치 하지 않는 경우 left_on , right_on을 사용해 맞춰주면 됨

   id   name  student_id  score
0   1  Alice           1     85
1   2    Bob           2     92
2   4  David           4     78

### 결합(concat)

In [ ]:
pd.concat( [emp,dept] ,axis=1 ) # axis=1 컬럼으로 붙임

   empno ename  dept  dept deptname
0      1   kim     1   1.0      관리직
1      2   lee     2   2.0      영업직
2      3  park     1   3.0      개발직
3      4  song     3   NaN      NaN
4      5   min     2   NaN      NaN

### 퀴즈
1. 3개의 데이터프레임을 하나로 병합(concat)한 후 아래의 문제를 해결하시오.
2. 년도별 사고(건) 평균을 구하시오.
3. 2016년과 2015년 사고를 대비할 때 가장 많이 증가한 월을 구하시오. 2016-2015 max인 것의 월 도출

In [73]:
# encoding: utf-8, euc-kr,cp949(행이 많은 경우)
sleep2014 =pd.read_csv('data/2014년 졸음운전 교통사고.csv', encoding='euc-kr')
sleep2015 =pd.read_csv('data/2015년 졸음운전 교통사고.csv', encoding='euc-kr')
sleep2016 =pd.read_csv('data/2016년 졸음운전 교통사고.csv', encoding='euc-kr')

In [75]:
# 1. 3개의 데이터프레임을 하나로 병합(concat)한 후 아래의 문제를 해결하시오.
sleepDF = pd.concat( [sleep2014,sleep2015,sleep2016]) 
sleepDF

          구분  사고(건)  사망(명)  부상(명)
0    2014년1월    169      7    347
1    2014년2월    145      3    268
2    2014년3월    206     12    358
3    2014년4월    182      4    360
4    2014년5월    218     17    474
5    2014년6월    233     13    457
6    2014년7월    229     14    431
7    2014년8월    222      9    447
8    2014년9월    225     15    430
9   2014년10월    210     14    392
10  2014년11월    209     10    386
11  2014년12월    178     12    329
0    2015년1월    205      8    375
1    2015년2월    175      8    375
2    2015년3월    237      4    492
3    2015년4월    227     10    486
4    2015년5월    231      9    504
5    2015년6월    207      8    401
6    2015년7월    273      7    556
7    2015년8월    268     19    534
8    2015년9월    252     10    501
9   2015년10월    214     14    475
10  2015년11월    199      3    398
11  2015년12월    213      8    428
0    2016년1월    192      5    387
1    2016년2월    174      6    328
2    2016년3월    217      7    435
3    2016년4월    216      7    419
4    2016년5월    239     13    522
5    2016년6월    200     12    362
6    2016년7월    227      9    460
7    2016년8월    230      7    490
8    2016년9월    187     13    347
9   2016년10월    183     10    367
10  2016년11월    200      5    418
11  2016년12월    168      4    364

In [79]:
sleepDF['년도'] = sleepDF['구분'].str[:5]
sleepDF['월'] = sleepDF['구분'].str[5:]

In [83]:
# 2. 년도별 사고(건) 평균을 구하시오.
sleepDF.groupby('년도')[['사고(건)']].mean()

            사고(건)
년도
2014년  202.166667
2015년  225.083333
2016년  202.750000

In [103]:
s2015 = sleepDF[sleepDF['년도']=='2015년'][['월','사고(건)']]
s2016 = sleepDF[sleepDF['년도']=='2016년'][['월','사고(건)']]
s2015.index = s2015['월']
s2016.index = s2016['월']
(s2016['사고(건)'] - s2015['사고(건)']).nlargest(1, keep='all').index
# sr = (s2016 - s2015)
# sr

Index(['5월'], dtype='object', name='월')

In [ ]:
s2015 = sleepDF[sleepDF['년도']=='2015년'][['월','사고(건)']]
s2016 = sleepDF[sleepDF['년도']=='2016년'][['월','사고(건)']]
s2015.set_index('월', inplace=True) #특정 값을 인덱스로 지정
s2016.set_index('월', inplace=True)
# s2016.reset_index() 0,1,2,3....으로 되돌림

     사고(건)
월
1월     192
2월     174
3월     217
4월     216
5월     239
6월     200
7월     227
8월     230
9월     187
10월    183
11월    200
12월    168

In [113]:
sleepDF

          구분  사고(건)  사망(명)  부상(명)     년도    월
0    2014년1월    169      7    347  2014년   1월
1    2014년2월    145      3    268  2014년   2월
2    2014년3월    206     12    358  2014년   3월
3    2014년4월    182      4    360  2014년   4월
4    2014년5월    218     17    474  2014년   5월
5    2014년6월    233     13    457  2014년   6월
6    2014년7월    229     14    431  2014년   7월
7    2014년8월    222      9    447  2014년   8월
8    2014년9월    225     15    430  2014년   9월
9   2014년10월    210     14    392  2014년  10월
10  2014년11월    209     10    386  2014년  11월
11  2014년12월    178     12    329  2014년  12월
0    2015년1월    205      8    375  2015년   1월
1    2015년2월    175      8    375  2015년   2월
2    2015년3월    237      4    492  2015년   3월
3    2015년4월    227     10    486  2015년   4월
4    2015년5월    231      9    504  2015년   5월
5    2015년6월    207      8    401  2015년   6월
6    2015년7월    273      7    556  2015년   7월
7    2015년8월    268     19    534  2015년   8월
8    2015년9월    252     10    501  2015년   9월
9   2015년10월    214     14    475  2015년  10월
10  2015년11월    199      3    398  2015년  11월
11  2015년12월    213      8    428  2015년  12월
0    2016년1월    192      5    387  2016년   1월
1    2016년2월    174      6    328  2016년   2월
2    2016년3월    217      7    435  2016년   3월
3    2016년4월    216      7    419  2016년   4월
4    2016년5월    239     13    522  2016년   5월
5    2016년6월    200     12    362  2016년   6월
6    2016년7월    227      9    460  2016년   7월
7    2016년8월    230      7    490  2016년   8월
8    2016년9월    187     13    347  2016년   9월
9   2016년10월    183     10    367  2016년  10월
10  2016년11월    200      5    418  2016년  11월
11  2016년12월    168      4    364  2016년  12월